app/controllers/clothing_items_controller.rb

   def index
       clothes = ClothingItem.all
---
SELECT "clothing_items".* FROM "clothing_items"

   def show
    render json: ClothingItem.find(params[:id])
---
SELECT "clothing_items".* FROM "clothing_items" WHERE "clothing_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

   def search
       foundItem = ClothingItem.new_search(params[:search]).first
---
SELECT "clothing_items".* FROM "clothing_items" ORDER BY "clothing_items"."id" ASC LIMIT ?  [["LIMIT", 1]]